performance/saucedemo-login.yml
config:
  target: "https://www.saucedemo.com"
  phases:
    - duration: 30
      arrivalRate: 5
  payload:
    path: "data/users.csv"
    fields:
      - username
      - password
  defaults:
    headers:
      content-type: "application/x-www-form-urlencoded"

scenarios:
  - name: "Simulated Login"
    flow:
      - post:
          url: "/"
          form:
            user-name: "{{ username }}"
            password: "{{ password }}"